src/cf/InformationRegisters/CRM_СобытияКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>CRM_СобытияКалендаря</Name>
			<Comment>Обязательное поле для вывода в календарь</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаВесьДень</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПомещениеСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Помещения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ВидыСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВходящееИсходящееСобытие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ВходящееИсходящееСобытие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_СостоянияСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнаяКатегорияСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_Категории</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКонтрольнойТочки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_СтатусыКонтрольныхТочек</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПартнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдСобытияGApi</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПоследовательностиGApi</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТаймСтампGApi</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизаторGApi</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодическоеСобытиеСпособИзмененияРядаGApi</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Балл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ВидыВзаимодействий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДела</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ВидыДелВзаимодействий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактТрудоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CRM_КонтрольнаяТочкаПроекта</v8:Type>
						<v8:Type>cfg:CatalogRef.МаркетинговыеМероприятия</v8:Type>
						<v8:Type>cfg:DocumentRef.CRM_Взаимодействие</v8:Type>
						<v8:Type>cfg:DocumentRef.CRM_Телемаркетинг</v8:Type>
						<v8:Type>cfg:DocumentRef.CRM_Мероприятие</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьCRM_Событие</v8:Type>
						<v8:Type>cfg:DocumentRef.CRM_ЭтапКалендарногоПлана</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>вогТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/CRM_СобытияКалендаря/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

/////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем Объект Экспорт;
Перем Параметры Экспорт;

/////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ОБЩИЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура Инициализация()
	Объект		= Неопределено;
	Параметры	= Неопределено;
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПЕРЕНОСА СОБЫТИЯ КАЛЕНДАРЯ НА ДРУГУЮ ДАТУ

Процедура ПеренестиОбъект_Документ_CRM_КонтрольнаяТочкаПроекта(Ошибки)
	// Если нужно переносить документ CRM_КонтрольнаяТочкаПроекта на другую дату
	// перетаскиванием в календаре, код переноса нужно разместить здесь.
	
КонецПроцедуры

Процедура ПеренестиОбъект_Задача_ЗадачаИсполнителя(Ошибки)
	Перем ПеренестиНаДатуВремя;
	Перем СобытиеНаВесьДень;
	Перем ПользовательОтбор;
	Перем СтарыйПользовательОтбор;
	
	Параметры.Свойство("ПеренестиНаДатуВремя",		ПеренестиНаДатуВремя);
	Параметры.Свойство("СобытиеНаВесьДень",			СобытиеНаВесьДень);
	Параметры.Свойство("ПользовательОтбор",			ПользовательОтбор);
	Параметры.Свойство("СтарыйПользовательОтбор",	СтарыйПользовательОтбор);
	
	Если ПеренестиНаДатуВремя = НачалоДня(ПеренестиНаДатуВремя) Тогда
		ПеренестиНаДатуВремя = ПеренестиНаДатуВремя + (Объект.СрокИсполнения - НачалоДня(Объект.СрокИсполнения));
	КонецЕсли;
	
	РезультатВыполнения = Истина;
	Попытка
		Если Объект.СрокИсполнения <> ПеренестиНаДатуВремя Тогда
			ЗадачаОбъект = Объект.ПолучитьОбъект();
			ЗадачаОбъект.Заблокировать();
			
			ЗадачаОбъект.СрокИсполнения = ПеренестиНаДатуВремя;
			ЗадачаОбъект.Записать();
		КонецЕсли;
	Исключение
		ИнфОбОшибке = ИнформацияОбОшибке();
		
		СтрОшибка = НСтр("ru = 'Не удалось перенести задачу: '")
			+ """" + Строка(Объект) + """: "
			+ КраткоеПредставлениеОшибки(ИнфОбОшибке);
		//
		Ошибки = Ошибки + ?(ПустаяСтрока(Ошибки), "", Символы.ПС);
		Ошибки = Ошибки + СтрОшибка;
		
		РезультатВыполнения = Ложь;
	КонецПопытки;
	
	Если РезультатВыполнения И ЗначениеЗаполнено(ПользовательОтбор) И ПользовательОтбор <> Объект.Исполнитель Тогда
		МассивЗадач = Новый Массив();
		МассивЗадач.Добавить(Объект);
		МассивПеренаправленныхЗадач = Новый Массив();
		CRM_БизнесПроцессыИЗадачиВызовСервера.ПеренаправитьЗадачи(МассивЗадач, ПользовательОтбор, Ложь, МассивПеренаправленныхЗадач);
		
		Если ТипЗнч(МассивПеренаправленныхЗадач) = Тип("Массив") И МассивПеренаправленныхЗадач.Количество() > 0 Тогда
			Попытка
				Если МассивПеренаправленныхЗадач[0].СрокИсполнения <> ПеренестиНаДатуВремя Тогда
					ЗадачаОбъект = МассивПеренаправленныхЗадач[0].ПолучитьОбъект();
					ЗадачаОбъект.Заблокировать();
					
					ЗадачаОбъект.СрокИсполнения = ПеренестиНаДатуВремя;
					ЗадачаОбъект.Записать();
				КонецЕсли;
			Исключение
				ИнфОбОшибке = ИнформацияОбОшибке();
				
				СтрОшибка = НСтр("ru = 'Не удалось перенести задачу: '")
					+ """" + Строка(Объект) + """: "
					+ КраткоеПредставлениеОшибки(ИнфОбОшибке);
				//
				Ошибки = Ошибки + ?(ПустаяСтрока(Ошибки), "", Символы.ПС);
				Ошибки = Ошибки + СтрОшибка;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПеренестиОбъектПоУмолчанию(Ошибки)
	Перем ПеренестиНаДатуВремя;
	Перем СобытиеНаВесьДень;
	Перем ПользовательОтбор;
	Перем ПомещениеОтбор;
	Перем СтарыйПользовательОтбор;
	Перем СтароеПомещениеОтбор;
	Перем ПериодНачало;
	Перем ПериодОкончание;
	Перем Пользователь;
	
	Параметры.Свойство("ПеренестиНаДатуВремя",		ПеренестиНаДатуВремя);
	Параметры.Свойство("СобытиеНаВесьДень",			СобытиеНаВесьДень);
	Параметры.Свойство("ПользовательОтбор",			ПользовательОтбор);
	Параметры.Свойство("ПомещениеОтбор",			ПомещениеОтбор);
	Параметры.Свойство("СтарыйПользовательОтбор",	СтарыйПользовательОтбор);
	Параметры.Свойство("СтароеПомещениеОтбор",		СтароеПомещениеОтбор);
	Параметры.Свойство("ПериодНачало",				ПериодНачало);
	Параметры.Свойство("ПериодОкончание",			ПериодОкончание);
	Параметры.Свойство("Пользователь",				Пользователь);
	
	Отбор.Объект.Установить(Объект);
	Если ЗначениеЗаполнено(ПериодНачало) Тогда
		Отбор.ПериодНачало.Установить(ПериодНачало);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПериодОкончание) Тогда
		Отбор.ПериодОкончание.Установить(ПериодОкончание);
	КонецЕсли;
	Если ЗначениеЗаполнено(Пользователь) Тогда
		Отбор.Пользователь.Установить(Пользователь);
	КонецЕсли;
	Прочитать();
	ТаблицаСобытия = Выгрузить();
	Очистить();
	Записать();
	
	Если ТаблицаСобытия.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	Для Каждого СтрокаТаблицы Из ТаблицаСобытия Цикл
		Если	ЗначениеЗаполнено(ПользовательОтбор)
			И	ЗначениеЗаполнено(СтарыйПользовательОтбор)
			И	ПользовательОтбор <> СтарыйПользовательОтбор Тогда
			//
			Если СтрокаТаблицы.Пользователь = СтарыйПользовательОтбор Тогда
				СтрокаТаблицы.Пользователь = ПользовательОтбор;
				Если ЗначениеЗаполнено(Отбор.Пользователь.Значение) И Отбор.Пользователь.Использование Тогда
					Отбор.Пользователь.Установить(СтрокаТаблицы.Пользователь);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если	ЗначениеЗаполнено(ПомещениеОтбор)
			И	ЗначениеЗаполнено(СтароеПомещениеОтбор)
			И	ПомещениеОтбор <> СтароеПомещениеОтбор Тогда
			//
			Если СтрокаТаблицы.ПомещениеСобытия = СтароеПомещениеОтбор Тогда
				СтрокаТаблицы.ПомещениеСобытия = ПомещениеОтбор;
			КонецЕсли;
		КонецЕсли;
		
		РазностьДат = СтрокаТаблицы.ПериодОкончание - СтрокаТаблицы.ПериодНачало;
		
		СтрокаТаблицы.ПериодНачало = ПеренестиНаДатуВремя;
		Если ЗначениеЗаполнено(Отбор.ПериодНачало.Значение) И Отбор.ПериодНачало.Использование Тогда
			Отбор.ПериодНачало.Установить(СтрокаТаблицы.ПериодНачало);
		КонецЕсли;
		
		СтрокаТаблицы.ПериодОкончание = СтрокаТаблицы.ПериодНачало + РазностьДат;
		Если ЗначениеЗаполнено(Отбор.ПериодОкончание.Значение) И Отбор.ПериодОкончание.Использование Тогда
			Отбор.ПериодОкончание.Установить(СтрокаТаблицы.ПериодОкончание);
		КонецЕсли;
	КонецЦикла;
	
	Загрузить(ТаблицаСобытия);
	Попытка
		Записать();
	Исключение
		СтрОшибка = ОписаниеОшибки();
		Ошибки = Ошибки + ?(ПустаяСтрока(Ошибки), "", Символы.ПС);
		Ошибки = Ошибки + СтрОшибка;
	КонецПопытки;
КонецПроцедуры

// Функция переносит объект
//
Функция ПеренестиОбъект() Экспорт
	Ошибки = "";
	
	Если Не ЗначениеЗаполнено(Объект) Тогда
		Ошибки = Ошибки + ?(ПустаяСтрока(Ошибки), "", Символы.ПС);
		Ошибки = Ошибки + НСтр("ru = 'Не выбран объект для переноса!'");
	КонецЕсли;
	Если ТипЗнч(Параметры) <> Тип("Структура") Тогда
		Ошибки = Ошибки + ?(ПустаяСтрока(Ошибки), "", Символы.ПС);
		Ошибки = Ошибки + НСтр("ru = 'Данные для действия не инициализированы!'");
	КонецЕсли;
	Если ТипЗнч(Параметры) = Тип("Структура") И (Не Параметры.Свойство("ПеренестиНаДатуВремя") Или Не ЗначениеЗаполнено(Параметры.ПеренестиНаДатуВремя)) Тогда
		Ошибки = Ошибки + ?(ПустаяСтрока(Ошибки), "", Символы.ПС);
		Ошибки = Ошибки + НСтр("ru = 'Не указана дата на которую переносится объект!'");
	КонецЕсли;
	
	Если Не ПустаяСтрока(Ошибки) Тогда Возврат Ошибки; КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("ДокументСсылка.CRM_КонтрольнаяТочкаПроекта") Тогда
		ПеренестиОбъект_Документ_CRM_КонтрольнаяТочкаПроекта(Ошибки);
		
	ИначеЕсли ТипЗнч(Объект) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		ПеренестиОбъект_Задача_ЗадачаИсполнителя(Ошибки);
		
	Иначе
		ПеренестиОбъектПоУмолчанию(Ошибки);
		
	КонецЕсли;
	
	Инициализация();
	
	Возврат Ошибки;
КонецФункции

//
/////////////////////////////////////////////////////////////////////////////////////////////////////////////


/////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ УДАЛЕНИЯ СОБЫТИЯ ИЗ КАЛЕНДАРЯ

Процедура УдалитьСсылочныйОбъектПоУмолчанию(УдаляемыйОбъект, Ошибки, ОчищатьЗаписиРегистраВручную = Ложь)
	Попытка
		ОбъектДляУдаления = УдаляемыйОбъект.Объект.ПолучитьОбъект();
		Попытка ОбъектДляУдаления.ДополнительныеСвойства.Вставить("ОбъектЗаписанПользователем");
		Исключение КонецПопытки;
		ОбъектДляУдаления.УстановитьПометкуУдаления(Истина);
	Исключение
		СтрОшибка = ОписаниеОшибки();
		Ошибки = Ошибки + ?(ПустаяСтрока(Ошибки), "", Символы.ПС);
		Ошибки = Ошибки + СтрОшибка;
	КонецПопытки;
	
	Если ОчищатьЗаписиРегистраВручную Тогда
		Отбор.Объект.Установить(УдаляемыйОбъект.Объект);
		Попытка
			Записать();
		Исключение
			СтрОшибка = ОписаниеОшибки();
			Ошибки = Ошибки + ?(ПустаяСтрока(Ошибки), "", Символы.ПС);
			Ошибки = Ошибки + СтрОшибка;
		КонецПопытки;
		
	КонецЕсли;
КонецПроцедуры

Процедура УдалитьОбъект_Документ_CRM_Событие(УдаляемыйОбъект, Ошибки)
	УдалитьСсылочныйОбъектПоУмолчанию(УдаляемыйОбъект, Ошибки, Ложь);
КонецПроцедуры

Процедура УдалитьОбъект_Документ_CRM_КонтрольнаяТочкаПроекта(УдаляемыйОбъект, Ошибки)
	УдалитьСсылочныйОбъектПоУмолчанию(УдаляемыйОбъект, Ошибки, Ложь);
КонецПроцедуры

Процедура УдалитьОбъектПоУмолчанию(УдаляемыйОбъект, Ошибки)
	Отбор.Объект.Установить(УдаляемыйОбъект.Объект);
	Если ЗначениеЗаполнено(УдаляемыйОбъект.ПериодНачало) Тогда
		Отбор.ПериодНачало.Установить(УдаляемыйОбъект.ПериодНачало);
	КонецЕсли;
	Если ЗначениеЗаполнено(УдаляемыйОбъект.ПериодОкончание) Тогда
		Отбор.ПериодОкончание.Установить(УдаляемыйОбъект.ПериодОкончание);
	КонецЕсли;
	Если ЗначениеЗаполнено(УдаляемыйОбъект.Пользователь) Тогда
		Отбор.Пользователь.Установить(УдаляемыйОбъект.Пользователь);
	КонецЕсли;
	Попытка
		Записать();
	Исключение
		СтрОшибка = ОписаниеОшибки();
		Ошибки = Ошибки + ?(ПустаяСтрока(Ошибки), "", Символы.ПС);
		Ошибки = Ошибки + СтрОшибка;
	КонецПопытки;
КонецПроцедуры

// Функция удаляет объект
//
Функция УдалитьОбъект() Экспорт
	Ошибки = "";
	
	Если Не ЗначениеЗаполнено(Объект) Тогда
		Ошибки = Ошибки + ?(ПустаяСтрока(Ошибки), "", Символы.ПС);
		Ошибки = Ошибки + НСтр("ru = 'Не выбран объект для переноса!'");
	КонецЕсли;
	
	Если Не ПустаяСтрока(Ошибки) Тогда Возврат Ошибки; КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("Массив") Тогда
		УдаляемыеОбъекты = Объект;
	Иначе
		УдаляемыеОбъекты = Новый Массив();
		УдаляемыеОбъекты.Добавить(Объект);
	КонецЕсли;
	
	Для Каждого УдаляемыйОбъект Из УдаляемыеОбъекты Цикл
		Если ТипЗнч(УдаляемыйОбъект.Объект) = Тип("ДокументСсылка.УдалитьCRM_Событие") Тогда
			УдалитьОбъект_Документ_CRM_Событие(УдаляемыйОбъект, Ошибки)
		ИначеЕсли ТипЗнч(УдаляемыйОбъект.Объект) = Тип("ДокументСсылка.CRM_КонтрольнаяТочкаПроекта") Тогда
			УдалитьОбъект_Документ_CRM_КонтрольнаяТочкаПроекта(УдаляемыйОбъект, Ошибки)
		Иначе
			УдалитьОбъектПоУмолчанию(УдаляемыйОбъект, Ошибки);
		КонецЕсли;
	КонецЦикла;
	
	Инициализация();
	
	Возврат Ошибки;
КонецФункции

//
/////////////////////////////////////////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////////////////////////////////////////
// ИНИЦИАЛИЗАЦИЯ

Инициализация();

#КонецЕсли
